common/modules/user/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM "user"."user" WHERE "id"='2'

    public function updateLoginMeta()
    {
        // set data
        $this->login_ip   = Yii::$app->getRequest()->getUserIP();
        $this->login_time = date("Y-m-d H:i:s");

        // save and return
        return $this->save(false, ["login_ip", "login_time"]);
---
UPDATE "user"."user" SET "login_time"='2015-03-21 07:04:26' WHERE "id"='2'