api/modules/file_management/controllers/UploadController.php

INSERT INTO "file_management"."temp_uploaded_file" ("base_name", "extension", "has_error", "size", "name", "temp_name", "type", "data") VALUES ('Building Damage2', 'jpg', , 30395, 'Building Damage2.jpg', '0Mv4QJl-pUADTBRhZhUkbDanDbk24bYP', 'jpg', (select '{"latitude":"27.699999722222223","longitude":"85.33319999999999"}'::JSON))
---
    public function actionFile()
    {
//        return ['ok'];
        $response=[];
        if(UploadedFile::getInstanceByName('file')){
            $temp = new TempUploadedFile([
                'uploadedFile'=>UploadedFile::getInstanceByName('file'),
                'data'=>Yii::$app->request->post(),
            ]);
            //$temp->setUploadedFile(UploadedFile::getInstanceByName('file'),Yii::$app->request->getBodyParams());
            try{
                $temp->save();