common/modules/rapid_assessment/models/ReportItem.php

SELECT * FROM "rapid_assessment"."item_type" WHERE type='emergency_situation'
---
    public static function getDropDownItemName($parentType){
        return \yii\helpers\ArrayHelper::map(ItemType::find()
            ->where('type=:type',[':type'=>$parentType])
            ->all(), 'item_name', 'item_name');