api/controllers/EventController.php

SELECT * FROM "reporting"."event" WHERE "id"='256'
---
    protected function findModel($id)
    {
        if (($model = Event::findOne($id)) !== null) {