api/modules/rapid_assessment/controllers/ReportItemController.php

SELECT * FROM "rapid_assessment"."item_class" WHERE item_name='Building Damage'
---
    public function actionItemClass()
    {
        $out = [];
        if (isset($_POST['depdrop_parents'])) {
            $parents = $_POST['depdrop_parents'];
            if ($parents != null) {
                $cat_id = $parents[0];
                //$out = self::getSubCatList($cat_id);
                $items = ItemClass::find()
                    ->where('item_name=:item_name', [':item_name' => $cat_id])
                    ->all();