common/modules/reporting/models/EmergencySituation.php

SELECT * FROM "reporting"."item_type" WHERE type=0
---
    public static function getDropDownItemName(){
        return \yii\helpers\ArrayHelper::map(ItemType::find()
            ->where('type=:type',[':type'=>ReportItem::TYPE_EMERGENCY_SITUATION])
            ->all(), 'item_name', 'item_name');