common/modules/reporting/models/Event.php

SELECT * FROM "reporting"."item_type" WHERE type=1
---
    public static function getDropDownItemName(){
        return \yii\helpers\ArrayHelper::map(ItemType::find()
            ->where('type=:type',[':type'=>ReportItem::TYPE_EVENT])
            ->all(), 'item_name', 'item_name');