common/modules/reporting/models/Incident.php

    public static function getDropDownItemName(){
        return \yii\helpers\ArrayHelper::map(ItemType::find()
            ->where('type=:type',[':type'=>ReportItem::TYPE_INCIDENT])
            ->all(), 'item_name', 'item_name');
---
SELECT * FROM "reporting"."item_type" WHERE type=2