common/modules/reporting/models/Need.php

SELECT * FROM "reporting"."item_type" WHERE type=4
---
    public static function getDropDownItemName(){
        return \yii\helpers\ArrayHelper::map(ItemType::find()
            ->where('type=:type',[':type'=>ReportItem::TYPE_NEED])
            ->all(), 'item_name', 'item_name');