common/modules/tracking/controllers/CrudDriverController.php

SELECT * FROM "tracking"."driver" WHERE "id"='6'
---
    protected function findModel($id)
    {
        if (($model = Driver::findOne($id)) !== null) {